In [78]:
import pandas as pd

# Introduction

In this lab we want you to learn and investigate some concepts in the context of Pandas: **concatenating**, **joining**, and **merging**. We want to review these concepts because it will make the subsequent work in transforming the datasets a lot more efficient.

# Concatenating, Joining, & Merging Tutorial


## Concatenating

Concatenating two dataframes combines two dataframes so that we append the rows of one dataframe at the end of the other. Our column names have to be identical for this function to work properly.

Below is an example of the `concat()` function in pandas

https://pandas.pydata.org/docs/reference/api/pandas.concat.html

In [79]:
df1 = pd.DataFrame({'A': ['a'+str(x) for x in range(3)],
                    'B': ['b'+str(x) for x in range(3)],
                    'C': ['c'+str(x) for x in range(3)]},
                     index=[0, 1, 2])

df2 = pd.DataFrame({'A': ['a'+str(x) for x in range(3, 6)],
                    'B': ['b'+str(x) for x in range(3, 6)],
                    'C': ['c'+str(x) for x in range(3, 6)]},
                     index=[3, 4, 5]) 

df3 = pd.DataFrame({'D': ['d'+str(x) for x in range(3)],
                    'E': ['e'+str(x) for x in range(3)],
                    'F': ['f'+str(x) for x in range(3)]},
                     index=[0, 1, 2]) 

df4 = pd.DataFrame({'D': ['d'+str(x) for x in range(3, 6)],
                    'E': ['e'+str(x) for x in range(3, 6)],
                    'F': ['f'+str(x) for x in range(3, 6)]},
                     index=[3, 4, 5]) 

# print(df1, '\n---\n', df2, '\n---\n', df3, '\n---\n',df4)

Let's try concatenating `df1` and `df2`, as well as `df3` and `df4`.

In [80]:
from IPython.display import display_html

In [81]:
df1_left = df1.style.set_table_attributes("style='display:inline'").set_caption('df1')
df2_right = df2.style.set_table_attributes("style='display:inline'").set_caption('df2')
display_html(df1_left._repr_html_() + "    " + df2_right._repr_html_(), raw=True)

,A,B,C
0,a0,b0,c0
1,a1,b1,c1
2,a2,b2,c2
,A,B,C
3,a3,b3,c3
4,a4,b4,c4
5,a5,b5,c5

In [82]:
# display both of the data frames side to side to understand the values, indexes and columns.

In [83]:
df_concat_1_2 = pd.concat([df1,df2], axis=0)
display(df_concat_1_2)

    A   B   C
0  a0  b0  c0
1  a1  b1  c1
2  a2  b2  c2
3  a3  b3  c3
4  a4  b4  c4
5  a5  b5  c5

In [84]:
# df1 complete df2, they have the same column names and indexes after each other.

In [85]:
df3_left = df3.style.set_table_attributes("style='display:inline'").set_caption('df3')
df4_right = df4.style.set_table_attributes("style='display:inline'").set_caption('df4')
display_html(df3_left._repr_html_() + "    " + df4_right._repr_html_(), raw=True)

,D,E,F
0,d0,e0,f0
1,d1,e1,f1
2,d2,e2,f2
,D,E,F
3,d3,e3,f3
4,d4,e4,f4
5,d5,e5,f5

In [86]:
# display both of the data frames side to side to understand the values, indexes and columns.

In [87]:
df_concat_3_4 = pd.concat([df3,df4], axis=0)

display(df_concat_3_4)

    D   E   F
0  d0  e0  f0
1  d1  e1  f1
2  d2  e2  f2
3  d3  e3  f3
4  d4  e4  f4
5  d5  e5  f5

In [88]:
# df3 complete df4, they have the same column names and indexes after each other.

From the output above, you see the second dataframe is appended at the bottom of the first dataframe.

Now let's try concatenating `df1`, `df2`, `df3`, and `df4` all together.

Note that the `sort=False` param is supplied to silence a warning message on a future Pandas change. It does not make any difference on the output.

In [89]:
df_all = pd.concat([df_concat_1_2,df_concat_3_4], axis=0)

display(df_all)

     A    B    C    D    E    F
0   a0   b0   c0  NaN  NaN  NaN
1   a1   b1   c1  NaN  NaN  NaN
2   a2   b2   c2  NaN  NaN  NaN
3   a3   b3   c3  NaN  NaN  NaN
4   a4   b4   c4  NaN  NaN  NaN
5   a5   b5   c5  NaN  NaN  NaN
0  NaN  NaN  NaN   d0   e0   f0
1  NaN  NaN  NaN   d1   e1   f1
2  NaN  NaN  NaN   d2   e2   f2
3  NaN  NaN  NaN   d3   e3   f3
4  NaN  NaN  NaN   d4   e4   f4
5  NaN  NaN  NaN   d5   e5   f5

**Conclusion of observation of the concat**

- We have NaN values because df1 and df2 the values are from A to C in the columns so in columns from D to F does not exist values for this columns. The same is happening on df3 and df4, the column values are from D to F so in A to C we dont have values. Thats why our df have this distribution.

---

What do we find?

* Pandas' `concat` method respects indexes of all axes. 
    * Because `df3` and `df4` have different column indexes than `df1` and `df2`, `concat` put them into different columns. 
    * `df3` and `df4` also retain their original row indexes of 0-5 instead of continuing from the last index of `df2`. 
* `concat` creates `NaN` at places where values are missing.

Try also supplying `ignore_index=True` to `concat`. How is the output different?

In [91]:
df_all = pd.concat([df_concat_1_2,df_concat_3_4], axis=0, ignore_index = True)

display(df_all)

      A    B    C    D    E    F
0    a0   b0   c0  NaN  NaN  NaN
1    a1   b1   c1  NaN  NaN  NaN
2    a2   b2   c2  NaN  NaN  NaN
3    a3   b3   c3  NaN  NaN  NaN
4    a4   b4   c4  NaN  NaN  NaN
5    a5   b5   c5  NaN  NaN  NaN
6   NaN  NaN  NaN   d0   e0   f0
7   NaN  NaN  NaN   d1   e1   f1
8   NaN  NaN  NaN   d2   e2   f2
9   NaN  NaN  NaN   d3   e3   f3
10  NaN  NaN  NaN   d4   e4   f4
11  NaN  NaN  NaN   d5   e5   f5

In [92]:
# our output differes because on the end of df2 the index does not start from 0 respecting the index from df3, the count of the index continuous until de the end of df4. 
# so now df3 and df4 have different index numbers, but the distribution of the values in the columns stay's the same.

## Merging and Joining

Pandas has two functions for joining datasets: `merge()` and `join()`. They perform the same task but have different options and syntax. 

Below is an example of `merge` and `join`.     
HINT (uses the column that repeats in both dataframes )

https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.merge.html

In [93]:
left = pd.DataFrame({'idx': ['i'+str(x) for x in range(3)],
                     'A': ['a'+str(x) for x in range(3)],
                     'B': ['b'+str(x) for x in range(3)]})


right = pd.DataFrame({'idx': ['i'+str(x) for x in range(1,4)],
                     'C': ['c'+str(x) for x in range(1,4)],
                     'D': ['d'+str(x) for x in range(1,4)]})

In [94]:
left

  idx   A   B
0  i0  a0  b0
1  i1  a1  b1
2  i2  a2  b2

In [95]:
right

  idx   C   D
0  i1  c1  d1
1  i2  c2  d2
2  i3  c3  d3

In [96]:
df_left = left.style.set_table_attributes("style='display:inline'").set_caption('left')
df_right = right.style.set_table_attributes("style='display:inline'").set_caption('right')
display_html(df_left._repr_html_() + "    " + df_right._repr_html_(), raw=True)

,idx,A,B
0,i0,a0,b0
1,i1,a1,b1
2,i2,a2,b2
,idx,C,D
0,i1,c1,d1
1,i2,c2,d2
2,i3,c3,d3

`join` is identical to `merge`. But when using join, we need to explicitly set the index column of the dataframes to join using `set_index`:

https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.join.html

In [97]:
merged_df = pd.merge(left,right)
merged_df

  idx   A   B   C   D
0  i1  a1  b1  c1  d1
1  i2  a2  b2  c2  d2

In [98]:
# To merge we are going row by row loking for the commun values in each df, left and right, and what is commun que pick to creat our new df.

In [99]:
left.set_index(["idx"]).join(right.set_index(["idx"]))

      A   B    C    D
idx
i0   a0  b0  NaN  NaN
i1   a1  b1   c1   d1
i2   a2  b2   c2   d2

In [100]:
merged_df = pd.merge(left,right, how="inner")
merged_df

  idx   A   B   C   D
0  i1  a1  b1  c1  d1
1  i2  a2  b2  c2  d2

In [101]:
left.merge(right, left_on=('A',"B"), right_on=('C',"D"))

Empty DataFrame
Columns: [idx_x, A, B, idx_y, C, D]
Index: []

In [102]:
left.merge(right, left_on='A', right_on="D")

Empty DataFrame
Columns: [idx_x, A, B, idx_y, C, D]
Index: []

And you see, `join` disregards the row of `right` with the unmatching index `i3`. It retains the row of `left` with the unmatching index `i0` but uses `NaN` for the missing data after joining.

#### There are other options we can explore with the `merge()` and `join()` functions. 

Specifically, we can specify `how`. This argument in the function tells us whether we are performing an inner, left, right, or outer join.

We can also specify a different column for joining in the `merge()` function using the `left_on` and `right_on` arguments. Check out the following documentations if you want to explore more:

[pandas.DataFrame.merge](https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.merge.html)

[pandas.DataFrame.join](https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.join.html)

## Bonus Question

Now if you look back on `merge` and `join`, you realize that in order to perform these functions on a set of dataframes, these dataframes must share a common column as the index. Only rows that have the same index values will be joined. This is similar to the [`join` function in MySQL](https://www.w3schools.com/sql/sql_join.asp), isn't it?

The bonus question for you is to figure out how to join and concatenate `df1`, `df2`, `df3`, and `df4` we created at the beginning of this challenge. Your end product should look like this:

![df1-2-3-4.png](../images/df1-2-3-4.png)

In [103]:
df1_left = df1.style.set_table_attributes("style='display:inline'").set_caption('df1')
df2_right = df2.style.set_table_attributes("style='display:inline'").set_caption('df2')
display_html(df1_left._repr_html_() + "    " + df2_right._repr_html_(), raw=True)

df3_left = df3.style.set_table_attributes("style='display:inline'").set_caption('df3')
df4_right = df4.style.set_table_attributes("style='display:inline'").set_caption('df4')
display_html(df3_left._repr_html_() + "    " + df4_right._repr_html_(), raw=True)

,A,B,C
0,a0,b0,c0
1,a1,b1,c1
2,a2,b2,c2
,A,B,C
3,a3,b3,c3
4,a4,b4,c4
5,a5,b5,c5

,D,E,F
0,d0,e0,f0
1,d1,e1,f1
2,d2,e2,f2
,D,E,F
3,d3,e3,f3
4,d4,e4,f4
5,d5,e5,f5

In [111]:
merge_1_2 = pd.merge(df1,df2)
display(merge_1_2)

Empty DataFrame
Columns: [A, B, C]
Index: []

In [112]:
merge_3_4 = pd.merge(df3,df4)
display(merge_3_4)

Empty DataFrame
Columns: [D, E, F]
Index: []

In [118]:
join_1_3 = df1.join(df3, how="inner")
display(join_1_3)

    A   B   C   D   E   F
0  a0  b0  c0  d0  e0  f0
1  a1  b1  c1  d1  e1  f1
2  a2  b2  c2  d2  e2  f2

In [119]:
join_2_4 = df2.join(df4, how="inner")
display(join_2_4)

    A   B   C   D   E   F
3  a3  b3  c3  d3  e3  f3
4  a4  b4  c4  d4  e4  f4
5  a5  b5  c5  d5  e5  f5

In [121]:
join_all = pd.concat([join_1_3,join_2_4], axis=0)
display(join_all)

    A   B   C   D   E   F
0  a0  b0  c0  d0  e0  f0
1  a1  b1  c1  d1  e1  f1
2  a2  b2  c2  d2  e2  f2
3  a3  b3  c3  d3  e3  f3
4  a4  b4  c4  d4  e4  f4
5  a5  b5  c5  d5  e5  f5